{
  "featured_posts": [
    {
      "id": "2024-12-01-bypassing-claude-url-limitations",
      "title": "Bypassing Claude's URL Limitations: A Deep Dive into AI-Powered Image Management",
      "category": "tech",
      "date": "2024-12-01",
      "excerpt": "Discover how I engineered a solution to overcome Claude's URL limitations for blog post images, enabling dynamic image hosting through GitHub and improving the visual appeal of AI-generated content.",
      "image": "/api/placeholder/800/400",
      "image_alt": "Abstract visualization of AI and web connectivity"
    },
    {
      "id": "2024-12-01-architecting-ai-worksheet-generator",
      "title": "Architecting an AI-Powered Worksheet Generator: A Journey Through Claude Projects and MCP",
      "category": "tech",
      "date": "2024-12-01",
      "excerpt": "Explore the architecture and implementation of an AI-powered worksheet generator using Claude and Model Context Protocol (MCP). Learn about system design, integration patterns, and practical applications in ESL education.",
      "image": "/api/placeholder/800/400",
      "image_alt": "Abstract diagram showing AI system architecture"
    },
    {
      "id": "2024-12-01-eu-wage-equality-directive",
      "title": "EU's New Wage Equality Directive: Closing the Gender Pay Gap",
      "category": "culture",
      "date": "2024-12-01",
      "excerpt": "Starting June 7, 2026, new regulations on pay transparency will take effect across the European Union, marking a significant step toward gender pay equality. Companies with over 50 employees will be required to disclose salary data.",
      "image": "/api/placeholder/800/400",
      "image_alt": "Woman in professional setting"
    },
    {
      "id": "2024-12-01-streaming-services-saturation-point",
      "title": "The Streaming Saturation Point: A Personal and Market Perspective",
      "category": "tech",
      "date": "2024-12-01",
      "excerpt": "An analysis of the streaming market slowdown through the lens of a power user, examining the implications for both global and Polish markets.",
      "image": "/api/placeholder/800/400",
      "image_alt": "Illustration showing multiple streaming service logos fading into the distance"
    }
  ],
  "last_updated": "2024-12-01T17:45:00Z"
}